# ---- Common AUR package list (one per line) ----

# Fonts/Icons
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
ttf-dejavu
ttf-ubuntu-mono-nerd
ttf-hack
ttf-hack-nerd
otf-codenewroman-nerd
otf-font-awesome

# Terminal
ghostty
foot
zsh
starship
fastfetch
zsh-completions
zsh-autosuggestions
zsh-syntax-highlighting
zsh-history-substring-search

# Audio
pipewire
pipewire-pulse
pipewire-alsa
pipewire-jack
wireplumber

# Video
ffmpeg
gstreamer

# Utils
gcc
podman
mise
bat
eza
fd
jq
yq
ripgrep
fzf
zoxide
resvg
imagemagick
neovim
tree-sitter-cli
lazygit
btop

# Web
firefox
