# ---- Common AUR package list (one per line) ----
# Wayland core
wayland
wayland-protocols
gtk3
gtk4
qt5-base
qt5-declarative
qt5-wayland
qt6-base
qt6-declarative
qt6-wayland
xdg-desktop-portal
polkit
uwsm
libnewt
xorg-xwayland

# Fonts/Icons
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
ttf-dejavu
ttf-ubuntu-mono-nerd
ttf-hack
ttf-hack-nerd

# Terminal
ghostty
foot
zsh
starship
fastfetch
zsh-completions
zsh-autosuggestions
zsh-syntax-highlighting
zsh-history-substring-search

# Audio
pipewire
wireplumber
pipewire-pulse
pavucontrol

# Video
ffmpeg
gstreamer
gst-libav
gst-plugin-pipewire
vlc

# Screenshot
grim
slurp

# Notify/Panels
libnotify
gvfs
gvfs-mtp
swaync
waybar

# Theme / Wallpaper
matugen-bin
swww

# Launchers
rofi-wayland

# Nvim
neovim
#bash-language-server
#lua-language-server
#pyright
#gopls
#rust-analyzer

# PDF
file
zathura
zathura-pdf-mupdf

# Utils
podman
mise
bat
eza
fd
jq
yq
ripgrep
fzf
zoxide
resvg
imagemagick
wl-clipboard
cliphist
yazi
thunar

# Web
firefox